# series.loc[indexer]

# dataframe.loc[row_indexer, column_indexer]

### .loc is purely label based
- integers are valid labels but, they refer to the label and NOT the position

### when slicing, both the start bound AND the stop bound are included, if present in the index

In [1]:
import pandas as pd

In [2]:
numbers = pd.read_csv('http://bit.ly/numberscsv')

In [3]:
numbers

   negative  positive worded  listed
0         0         0   zero     [0]
1        -1         1    one  [-1,1]
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]
5        -5         5   five  [-5,5]

In [4]:
numbers.loc[0]

negative       0
positive       0
worded      zero
listed       [0]
Name: 0, dtype: object

In [5]:
numbers_mod = numbers.set_index('worded')

In [6]:
numbers_mod

        negative  positive  listed
worded
zero           0         0     [0]
one           -1         1  [-1,1]
two           -2         2  [-2,2]
three         -3         3  [-3,3]
four          -4         4  [-4,4]
five          -5         5  [-5,5]

In [7]:
numbers_mod.loc['zero']

negative      0
positive      0
listed      [0]
Name: zero, dtype: object

In [8]:
numbers.loc[:, 'positive']

0    0
1    1
2    2
3    3
4    4
5    5
Name: positive, dtype: int64

In [9]:
numbers.loc[0, 'positive']

0

In [10]:
numbers.loc[2:5]

   negative  positive worded  listed
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]
5        -5         5   five  [-5,5]

In [11]:
numbers.loc[:, 'negative':'worded']

   negative  positive worded
0         0         0   zero
1        -1         1    one
2        -2         2    two
3        -3         3  three
4        -4         4   four
5        -5         5   five

In [12]:
numbers.loc[:, ['negative', 'positive', 'worded']]

   negative  positive worded
0         0         0   zero
1        -1         1    one
2        -2         2    two
3        -3         3  three
4        -4         4   four
5        -5         5   five

In [25]:
numbers.loc[:, 'worded':'negative':-1]

  worded  positive  negative
0   zero         0         0
1    one         1        -1
2    two         2        -2
3  three         3        -3
4   four         4        -4
5   five         5        -5

In [26]:
numbers.loc[2:5, 'negative':'worded']

   negative  positive worded
2        -2         2    two
3        -3         3  three
4        -4         4   four
5        -5         5   five

In [27]:
numbers.loc[[2,3,4,5], ['negative', 'positive', 'worded']]

   negative  positive worded
2        -2         2    two
3        -3         3  three
4        -4         4   four
5        -5         5   five

In [29]:
numbers.loc[numbers.loc[:, 'positive'] > 1, :]

   negative  positive worded  listed
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]
5        -5         5   five  [-5,5]

In [30]:
numbers.loc[(numbers.loc[:, 'positive'] > 1) & (numbers.loc[:, 'positive'] < 5), :]

   negative  positive worded  listed
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]

In [31]:
numbers_mod

        negative  positive  listed
worded
zero           0         0     [0]
one           -1         1  [-1,1]
two           -2         2  [-2,2]
three         -3         3  [-3,3]
four          -4         4  [-4,4]
five          -5         5  [-5,5]

In [32]:
numbers_mod.iloc[0]

negative      0
positive      0
listed      [0]
Name: zero, dtype: object

In [33]:
numbers_mod.iloc[:, 2]

worded
zero        [0]
one      [-1,1]
two      [-2,2]
three    [-3,3]
four     [-4,4]
five     [-5,5]
Name: listed, dtype: object

In [34]:
numbers_mod.iloc[2, 0]

-2

In [35]:
numbers_mod.iloc[2:5]

        negative  positive  listed
worded
two           -2         2  [-2,2]
three         -3         3  [-3,3]
four          -4         4  [-4,4]

In [36]:
numbers_mod.iloc[:, 1:3]

        positive  listed
worded
zero           0     [0]
one            1  [-1,1]
two            2  [-2,2]
three          3  [-3,3]
four           4  [-4,4]
five           5  [-5,5]

In [40]:
numbers_mod.iloc[2:5, 1:3]

        positive  listed
worded
two            2  [-2,2]
three          3  [-3,3]
four           4  [-4,4]

In [41]:
numbers_mod.iloc[2:5, [1, 2, 3]]

IndexError: positional indexers are out-of-bounds

In [42]:
numbers

   negative  positive worded  listed
0         0         0   zero     [0]
1        -1         1    one  [-1,1]
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]
5        -5         5   five  [-5,5]

In [43]:
numbers.loc[0:7]

   negative  positive worded  listed
0         0         0   zero     [0]
1        -1         1    one  [-1,1]
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]
5        -5         5   five  [-5,5]

In [51]:
numbers.loc[[0,1,2,3,4,5,6,7]]

c:\users\devante\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   negative  positive worded  listed
0       0.0       0.0   zero     [0]
1      -1.0       1.0    one  [-1,1]
2      -2.0       2.0    two  [-2,2]
3      -3.0       3.0  three  [-3,3]
4      -4.0       4.0   four  [-4,4]
5      -5.0       5.0   five  [-5,5]
6       NaN       NaN    NaN     NaN
7       NaN       NaN    NaN     NaN

### [] (aka __getitem__())

series[label]

df[colname]

In [52]:
numbers

   negative  positive worded  listed
0         0         0   zero     [0]
1        -1         1    one  [-1,1]
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]
5        -5         5   five  [-5,5]

In [53]:
numbers['worded']

0     zero
1      one
2      two
3    three
4     four
5     five
Name: worded, dtype: object

In [54]:
numbers[2:5]

   negative  positive worded  listed
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]

In [57]:
numbers_mod

        negative  positive  listed
worded
zero           0         0     [0]
one           -1         1  [-1,1]
two           -2         2  [-2,2]
three         -3         3  [-3,3]
four          -4         4  [-4,4]
five          -5         5  [-5,5]

In [58]:
numbers_mod['two':'five']

        negative  positive  listed
worded
two           -2         2  [-2,2]
three         -3         3  [-3,3]
four          -4         4  [-4,4]
five          -5         5  [-5,5]

In [67]:
numbers[numbers.positive > 1]

   negative  positive worded  listed
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]
5        -5         5   five  [-5,5]

In [68]:
numbers

   negative  positive worded  listed
0         0         0   zero     [0]
1        -1         1    one  [-1,1]
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
4        -4         4   four  [-4,4]
5        -5         5   five  [-5,5]

In [69]:
numbers.loc[[False, False, True, True, False, True]]

   negative  positive worded  listed
2        -2         2    two  [-2,2]
3        -3         3  three  [-3,3]
5        -5         5   five  [-5,5]

In [70]:
numbers.loc[:, lambda df: ['positive', 'worded']]

   positive worded
0         0   zero
1         1    one
2         2    two
3         3  three
4         4   four
5         5   five